ИСПП/src/Documents/ГЗ/ГЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ГЗ</name>
  <basedOn>Document.СпецификацияКДоговору</basedOn>
  <registerRecords>AccumulationRegister.ИсполнениеПроектов</registerRecords>
  <attributes>
    <name>НомерПроекта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ДобывающаяОрганизация</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерПисьма</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ФайлПисьмо</name>
    <type>
      <types>CatalogRef.ГЗПрисоединенныеФайлы</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаВВалюте</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>16</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Гриф</name>
    <type>
      <types>CatalogRef.Грифы</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроизвольныйПредметПроекта</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПредметаПроекта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусЗадания</name>
    <type>
      <types>EnumRef.СтатусЗадания</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПредметыПроекта</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ИСПП/src/AccumulationRegisters/ИсполнениеПроектов/ИсполнениеПроектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ИсполнениеПроектов</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаПеречислено</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПроектЗадания</name>
    <type>
      <types>DocumentRef.ПроектЗадания</types>
      <types>DocumentRef.ГЗ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ИСПП/src/Documents/ГЗ/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Объект, ЭтотОбъект);
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	// СтандартныеПодсистемы.Свойства
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", Элементы.ГруппаДополнительныеРеквизиты.Имя);
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	// Конец СтандартныеПодсистемы.Свойства
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	НастройкаФормПоддержкаПроектов.ФормаДокумента_ПриСозданииНаСервере(ЭтотОбъект);
	
	Если Не Объект.Ссылка.Пустая() Тогда
		ПолучитьБалансПроекта();
	КонецЕсли;
	
	Элементы.ПредметыПроекта.Доступность = Не Объект.ПроизвольныйПредметПроекта;
	Элементы.НаименованиеПредметаПроекта.Доступность = Объект.ПроизвольныйПредметПроекта;
	
	ЗапрещенныеРасширения = РаботаСФайламиСлужебный.СписокЗапрещенныхРасширений();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ПолучитьБалансПроекта()
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	ПолучитьБалансПроекта();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// СтандартныеПодсистемы.Свойства
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
	
	Если ИмяСобытия = "Запись_Файл" И Параметр.ВладелецФайла = Объект.Ссылка Тогда
		
		Модифицированность = Истина;
		СсылкаНаФайл = Параметр.Файл;
		
		Если ВыборПисьма Тогда
		
			Объект.ФайлПисьмо = СсылкаНаФайл;
			АдресПисьма = НавигационнаяСсылкаФайла(Объект.ФайлПисьмо, УникальныйИдентификатор);
			ВыборПисьма = Ложь;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПроизвольныйПредметПроектаПриИзменении(Элемент)
	Элементы.ПредметыПроекта.Доступность = Не Объект.ПроизвольныйПредметПроекта;
	Элементы.НаименованиеПредметаПроекта.Доступность = Объект.ПроизвольныйПредметПроекта;
	Если Объект.ПроизвольныйПредметПроекта Тогда
		Объект.ПредметыПроекта.Очистить();
	Иначе
		Объект.НаименованиеПредметаПроекта = "";
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ФайлПисьмоНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ВыбратьФайлИзПрисоединенныхФайлов("ФайлПисьмо");
КонецПроцедуры

&НаКлиенте
Процедура ЗаСчетСредствФАИВПриИзменении(Элемент)
	
	Элементы.ГруппаПеречисления.Видимость = Объект.ЗаСчетСредствФОИВ;
	ОчиститьТаблицуПеречислений();
	
КонецПроцедуры

&НаКлиенте
Процедура ФайлПисьмоОткрытие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОткрытьФайл("ФайлПисьмо");
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура ДобавитьПисьмо(Команда)
	
	ЗаблокироватьДанныеФормыДляРедактирования();
	ДобавитьФайлНаКлиенте("ВыборПисьма");
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции



&НаСервере
Процедура ЗполнитьРеквизитыФайла(Файл, РеквизитыФайла)
	Для Каждого Элемент Из РеквизитыФайла Цикл
		РеквизитыФайла[Элемент.Ключ] = Файл[Элемент.Ключ];
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФайл(Элемент)
		
	ТекущиеДанные = Объект[Элемент];
	
	//@skip-warning
	РеквизитыФайла = Новый Структура("Зашифрован, Расширение, Наименование, Ссылка");
	ЗполнитьРеквизитыФайла(ТекущиеДанные, РеквизитыФайла);
	
	Если РеквизитыФайла.Зашифрован Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗапрещенныеРасширения.НайтиПоЗначению(РеквизитыФайла.Расширение) <> Неопределено Тогда
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("ТекущиеДанные", ТекущиеДанные);
		//@skip-warning
		Оповещение = Новый ОписаниеОповещения("ОткрытьФайлПослеПодтверждения", ЭтотОбъект, ДополнительныеПараметры);
		ПараметрыФормы = Новый Структура("Ключ", "ПередОткрытиемФайла");
		ПараметрыФормы.Вставить("ИмяФайла",
			ОбщегоНазначенияКлиентСервер.ПолучитьИмяСРасширением(РеквизитыФайла.Наименование, ТекущиеДанные.Расширение));
		ОткрытьФорму("ОбщаяФорма.ПредупреждениеБезопасности", ПараметрыФормы, , , , , Оповещение);
		Возврат;
	КонецЕсли;
	
	ФайлРедактируется = Ложь;
	
	ДанныеФайла = РаботаСФайламиСлужебныйВызовСервера.ДанныеФайлаДляОткрытия(РеквизитыФайла.Ссылка, Неопределено, УникальныйИдентификатор);
	Если ДанныеФайла.Зашифрован Тогда
		// Файл может быть изменен в другом сеансе.
		ОповеститьОбИзменении(РеквизитыФайла.Ссылка);
		Возврат;
	КонецЕсли;
	
	РаботаСФайламиКлиент.ОткрытьФайл(ДанныеФайла, ФайлРедактируется);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьФайлНаКлиенте(Реквизит)
	
	Если Объект.Ссылка.Пустая() Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Необходимо записать объект!");
		
	Иначе
		ЭтотОбъект[Реквизит] = Истина;
		ИдентификаторФайла = Новый УникальныйИдентификатор;
		РаботаСФайламиКлиент.ДобавитьФайлы(Объект.Ссылка, ИдентификаторФайла, ФильтрФайлов());
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОчиститьТаблицуПеречислений()
	
	Объект.Перечисления.Очистить();
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьБалансПроекта()
	
	ЗапросОстаткаПоДоговору = Новый Запрос();
	ЗапросОстаткаПоДоговору.Текст = "ВЫБРАТЬ
	                                |	ИсполнениеПроектовОстатки.СуммаОстаток КАК СуммаОстаток
	                                |ИЗ
	                                |	РегистрНакопления.ИсполнениеПроектов.Остатки(
	                                |			,
	                                |			Организация = &Организация
	                                |				И ПроектЗадания = &ПроектЗадания) КАК ИсполнениеПроектовОстатки";
	ЗапросОстаткаПоДоговору.УстановитьПараметр("ПроектЗадания", Объект.Ссылка);
	ЗапросОстаткаПоДоговору.УстановитьПараметр("Организация", Объект.Организация);
	
	Выборка = ЗапросОстаткаПоДоговору.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		БалансПроекта = Выборка.СуммаОстаток;
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СТАНДАРТНЫЕ ПОДСИСТЕМЫ
#Область СтандартныеПодсистемы

// СтандартныеПодсистемы.Свойства

&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
	УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
КонецПроцедуры

&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

//&НаКлиенте
//Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
//	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
//КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

// Конец СтандартныеПодсистемы.Свойства

// СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти // СтандартныеПодсистемы

&НаКлиенте
Функция ФильтрФайлов()
	//@skip-warning
	Возврат НСтр("ru = 'Все файлы(*.*)|*.*"
		                            + "|Изображения (*.bmp;*.gif;*.png;*.jpeg;*.jpg)|*.bmp;*.gif;*.png;*.jpeg;*.jpg"
		                            + "|Формат MS WORD(*.doc*;*.docx)|*.doc;*.docx"
		                            + "|Формат PDF(*.PDF*)|*.PDF'");
КонецФункции

&НаКлиенте
Процедура ВыбратьФайлИзПрисоединенныхФайлов(Элемент)
	
	ПараметрыВыбораФайла = Новый Структура("ВладелецФайла, ЗакрыватьПриВыборе, РежимВыбора", Объект.Ссылка, Истина, Истина);
	ДополнительныеПараметры = Новый Структура("Элемент", Элемент);	
	Оповещение = Новый ОписаниеОповещения("ВыбратьФайлИзПрисоединенныхФайловЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	ОткрытьФорму("Обработка.РаботаСФайлами.Форма.ПрисоединенныеФайлы", ПараметрыВыбораФайла, ЭтотОбъект,,,, Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьФайлИзПрисоединенныхФайловЗавершение(ЗначениеВыбора, ДополнительныеПараметры) Экспорт
	
	Соответствие = Новый Соответствие();
	Соответствие.Вставить("ФайлПисьмо", "АдресПисьма");
	
	Если ЗначениеЗаполнено(ЗначениеВыбора) Тогда
		
		Объект[ДополнительныеПараметры.Элемент] = ЗначениеВыбора;
		
		ЭтотОбъект[Соответствие.Получить(ДополнительныеПараметры.Элемент)] = НавигационнаяСсылкаФайла(Объект[ДополнительныеПараметры.Элемент], УникальныйИдентификатор);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция НавигационнаяСсылкаФайла(Знач Файл, Знач ИдентификаторФормы)
	
	УстановитьПривилегированныйРежим(Истина);
	Возврат РаботаСФайлами.ДанныеФайла(Файл, ИдентификаторФормы).СсылкаНаДвоичныеДанныеФайла;
	
КонецФункции

#КонецОбласти
